АлогистикТест2/src/DataProcessors/алк_ПечатьБланкТоварногоНаполнения/алк_ПечатьБланкТоварногоНаполнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_ПечатьБланкТоварногоНаполнения</name>
</mdclass:DataProcessor>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПакетыИсторияЗаказов/алк_ПакетыИсторияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПакетыИсторияЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ПеремещениеЗапасов/алк_ПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПеремещениеЗапасов</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиНезавершенногоПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизацииСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиПродукция</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.алк_ВидыОперацийПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтабельПолучатель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентифицирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодПакетаГод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыНоменклатуры</name>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/DataProcessors/алк_ПечатьБланкТоварногоНаполнения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	Функция КлючПараметровПечати() Экспорт
		
		Возврат "ПАРАМЕТРЫ_ПЕЧАТИ_Универсальные_БланкТоварногоНаполнения";
		
	КонецФункции
	
	Функция ПолныйПутьКМакету() Экспорт
		
		Возврат "Обработка.алк_ПечатьБланкТоварногоНаполнения.ПФ_MXL_БланкТоварногоНаполнения";
		
	КонецФункции
	
	Функция ПредставлениеПФ() Экспорт
		
		Возврат НСтр("ru ='Бланк товарного наполнения'");
		
	КонецФункции
	
	Функция СформироватьПФ(ОписаниеПечатнойФормы, ДанныеОбъектовПечати, ОбъектыПечати) Экспорт
		Перем ПервыйДокумент, НомерСтрокиНачало, Ошибки;
		
		Макет				= УправлениеПечатью.МакетПечатнойФормы(ОписаниеПечатнойФормы.ПолныйПутьКМакету);
		ТабличныйДокумент	= ОписаниеПечатнойФормы.ТабличныйДокумент;
		ДанныеПечати		= Новый Структура;
		ЕстьТЧЗапасы		= (ДанныеОбъектовПечати.Колонки.Найти("ТаблицаЗапасы") <> Неопределено);
		ЕстьТЧМатериалы		= (ДанныеОбъектовПечати.Колонки.Найти("ТаблицаМатериалы") <> Неопределено);
		
		Для каждого ДанныеОбъекта Из ДанныеОбъектовПечати Цикл
			
			ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало, ДанныеПечати);
			
			МассивОбластейМакета = Новый Массив;
			МассивОбластейМакета.Добавить("Заголовок");
			МассивОбластейМакета.Добавить("Склад");
			МассивОбластейМакета.Добавить("ВремяПечати");
			
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ДанныеОбъекта.ДатаДокумента, ДанныеОбъекта.Номер, ДанныеОбъекта.Префикс);
			ТекстЗаголовка = ДанныеОбъекта.ПредставлениеРегистратора + "  № " + НомерДокумента + " от " + Формат(ДанныеОбъекта.ДатаДокумента, "ДЛФ=DD");
			ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
			ДанныеПечати.Вставить("ПредставлениеСклада", ДанныеОбъекта.ПредставлениеСклада);
			
			Если ПолучитьФункциональнуюОпцию("УчетПоЯчейкам") Тогда
				
				МассивОбластейМакета.Вставить(2, "Ячейка");
				ДанныеПечати.Вставить("ПредставлениеЯчейки", ДанныеОбъекта.ПредставлениеЯчейки);
				
			КонецЕсли;
			
			ВремяПечати = НСтр("ru ='Дата и время печати: '") + ТекущаяДатаСеанса() + НСтр("ru ='. Пользователь: '") + Пользователи.АвторизованныйПользователь();
			ДанныеПечати.Вставить("ВремяПечати", ВремяПечати);
			
			Для каждого ИмяОбласти Из МассивОбластейМакета Цикл
				
				ОбластьМакета = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, ИмяОбласти, "", Ошибки);
				Если ОбластьМакета <> Неопределено Тогда
					
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
				КонецЕсли;
				
			КонецЦикла;
			
			ОбластьМакета = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "Строка", "", Ошибки);
			ОбластьМакетаШапка = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "ШапкаТаблицы", "", Ошибки);
			Если ОбластьМакета <> Неопределено
				И ОбластьМакетаШапка <> Неопределено Тогда
				
				ОбластьМакетаИтого = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "Итого", "", Ошибки);
				ТаблицаСерийныеНомера = ДанныеОбъекта.ТаблицаСерийныеНомера;
				ПараметрыНоменклатуры = Новый Структура;
				
				Если ЕстьТЧЗапасы Тогда
					
					ДанныеПечати.Вставить("ТипНоменклатурыТаблицы", Нстр("ru ='Запасы'"));
					ОбластьМакетаШапка.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
					
					Для каждого СтрокаТаблицыЗапасы Из ДанныеОбъекта.ТаблицаЗапасы Цикл
						
						Если НЕ СтрокаТаблицыЗапасы.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
							
							Продолжить;
							
						КонецЕсли;
						
						ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТаблицыЗапасы, ДанныеПечати, ПараметрыНоменклатуры, ТаблицаСерийныеНомера);
						
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
					КонецЦикла;
					
					Если ОбластьМакетаИтого <> Неопределено Тогда
						
						ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЕстьТЧМатериалы Тогда
					
					ДанныеПечати.Вставить("ТипНоменклатурыТаблицы", Нстр("ru ='Материалы'"));
					ОбластьМакетаШапка.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
					
					Для каждого СтрокаТаблицыМатериалов Из ДанныеОбъекта.ТаблицаМатериалы Цикл
						
						Если НЕ СтрокаТаблицыМатериалов.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
							
							Продолжить;
							
						КонецЕсли;
						
						ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТаблицыМатериалов, ДанныеПечати, ПараметрыНоменклатуры, ТаблицаСерийныеНомера);
						
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
					КонецЦикла;
					
					Если ОбластьМакетаИтого <> Неопределено Тогда
						
						ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеОбъекта.Ссылка);
			
		КонецЦикла;
		
		Возврат ТабличныйДокумент;
		
	КонецФункции
	
	Функция алк_СформироватьПФ(ОписаниеПечатнойФормы, ДанныеОбъектовПечати, ОбъектыПечати) Экспорт
		Перем ПервыйДокумент, НомерСтрокиНачало, Ошибки;
		
		Макет				= УправлениеПечатью.МакетПечатнойФормы(ОписаниеПечатнойФормы.ПолныйПутьКМакету);
		ТабличныйДокумент	= ОписаниеПечатнойФормы.ТабличныйДокумент;
		ДанныеПечати		= Новый Структура;
		ЕстьТЧЗапасы		= (ДанныеОбъектовПечати.Колонки.Найти("ТаблицаЗапасы") <> Неопределено);
		ЕстьТЧМатериалы		= (ДанныеОбъектовПечати.Колонки.Найти("ТаблицаМатериалы") <> Неопределено);
		
		Для каждого ДанныеОбъекта Из ДанныеОбъектовПечати Цикл
			
			ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало, ДанныеПечати);
			
			МассивОбластейМакета = Новый Массив;
			МассивОбластейМакета.Добавить("Заголовок");
			МассивОбластейМакета.Добавить("Склад");
			МассивОбластейМакета.Добавить("ВремяПечати");
			
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ДанныеОбъекта.ДатаДокумента, ДанныеОбъекта.Номер, ДанныеОбъекта.Префикс);
			ТекстЗаголовка = ДанныеОбъекта.ПредставлениеРегистратора + "  № " + НомерДокумента + " от " + Формат(ДанныеОбъекта.ДатаДокумента, "ДЛФ=DD");
			ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
			ДанныеПечати.Вставить("ПредставлениеСклада", ДанныеОбъекта.ПредставлениеСклада);
			
			Если ПолучитьФункциональнуюОпцию("УчетПоЯчейкам") Тогда
				
				МассивОбластейМакета.Вставить(2, "Ячейка");
				ДанныеПечати.Вставить("ПредставлениеЯчейки", ДанныеОбъекта.ПредставлениеЯчейки);
				
			КонецЕсли;
			
			ВремяПечати = НСтр("ru ='Дата и время печати: '") + ТекущаяДатаСеанса() + НСтр("ru ='. Пользователь: '") + Пользователи.АвторизованныйПользователь();
			ДанныеПечати.Вставить("ВремяПечати", ВремяПечати);
			
			Для каждого ИмяОбласти Из МассивОбластейМакета Цикл
				
				ОбластьМакета = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, ИмяОбласти, "", Ошибки);
				Если ОбластьМакета <> Неопределено Тогда
					
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
				КонецЕсли;
				
			КонецЦикла;
			
			ОбластьМакета = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "Строка", "", Ошибки);
			ОбластьМакетаШапка = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "ШапкаТаблицы", "", Ошибки);
			Если ОбластьМакета <> Неопределено
				И ОбластьМакетаШапка <> Неопределено Тогда
				
				ОбластьМакетаИтого = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "Итого", "", Ошибки);
				//ТаблицаСерийныеНомера = ДанныеОбъекта.ТаблицаСерийныеНомера;
				ПараметрыНоменклатуры = Новый Структура;
				
				Если ЕстьТЧЗапасы Тогда
					
					ДанныеПечати.Вставить("ТипНоменклатурыТаблицы", Нстр("ru ='Запасы'"));
					ОбластьМакетаШапка.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
				    ЗаполнитьДанныеПечати(ДанныеПечати,ДанныеОбъекта,Макет,ТабличныйДокумент);
					//Для каждого СтрокаТаблицыЗапасы Из ДанныеОбъекта.ТаблицаЗапасы Цикл
					//	
					//	Если НЕ СтрокаТаблицыЗапасы.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
					//		
					//		Продолжить;
					//		
					//	КонецЕсли;
					//	
					//	алк_ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТаблицыЗапасы, ДанныеПечати, ПараметрыНоменклатуры);
					//	
					//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					//	ТабличныйДокумент.Вывести(ОбластьМакета);
					//	
					//КонецЦикла;
					
					Если ОбластьМакетаИтого <> Неопределено Тогда
						
						ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЕстьТЧМатериалы Тогда
					
					ДанныеПечати.Вставить("ТипНоменклатурыТаблицы", Нстр("ru ='Материалы'"));
					ОбластьМакетаШапка.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
					
					Для каждого СтрокаТаблицыМатериалов Из ДанныеОбъекта.ТаблицаМатериалы Цикл
						
						Если НЕ СтрокаТаблицыМатериалов.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
							
							Продолжить;
							
						КонецЕсли;
						
						//ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТаблицыМатериалов, ДанныеПечати, ПараметрыНоменклатуры, ТаблицаСерийныеНомера);
						
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
					КонецЦикла;
					
					Если ОбластьМакетаИтого <> Неопределено Тогда
						
						ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеОбъекта.Ссылка);
			
			
		КонецЦикла;
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // алк_СформироватьПФ()
	
	Процедура ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ДанныеПечати, ПараметрыНоменклатуры, ТаблицаСерийныеНомера)
		
		ДанныеПечати.Очистить();
		
		ДанныеПечати.Вставить("НомерСтроки", СтрокаТабличнойЧасти.НомерСтроки);
		
		СтрокаСерийныеНомера = ПечатьДокументовУНФ.ПредставлениеСерийногоНомера(ТаблицаСерийныеНомера, СтрокаТабличнойЧасти.КлючСвязи);
		
		ПараметрыНоменклатуры.Очистить();
		ПараметрыНоменклатуры.Вставить("Содержание", СтрокаТабличнойЧасти.Содержание);
		ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры", СтрокаТабличнойЧасти.ПредставлениеНоменклатуры);
		ПараметрыНоменклатуры.Вставить("ПредставлениеХарактеристики", СтрокаТабличнойЧасти.Характеристика);
		ПараметрыНоменклатуры.Вставить("ПредставлениеАртикула", СтрокаТабличнойЧасти.Артикул);
		ПараметрыНоменклатуры.Вставить("СтрокаСерийныеНомера", СтрокаСерийныеНомера);
		ДанныеПечати.Вставить("ПредставлениеНоменклатуры", ПечатьДокументовУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры));
		
		ДанныеПечати.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
		ДанныеПечати.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧасти.ЕдиницаИзмерения);
		ДанныеПечати.Вставить("Склад", СтрокаТабличнойЧасти.Склад);
		ДанныеПечати.Вставить("Ячейка", СтрокаТабличнойЧасти.Ячейка);
		
	КонецПроцедуры
	
	Процедура алк_ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ДанныеПечати, ПараметрыНоменклатуры)
		
		ДанныеПечати.Очистить();
		
		ДанныеПечати.Вставить("НомерСтроки", СтрокаТабличнойЧасти.НомерСтроки);
		
		//СтрокаСерийныеНомера = ПечатьДокументовУНФ.ПредставлениеСерийногоНомера(ТаблицаСерийныеНомера, СтрокаТабличнойЧасти.КлючСвязи);
		//
		ПараметрыНоменклатуры.Очистить();
		//ПараметрыНоменклатуры.Вставить("Содержание", СтрокаТабличнойЧасти.Содержание);
		ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры", СтрокаТабличнойЧасти.ПредставлениеНоменклатуры);
		//ПараметрыНоменклатуры.Вставить("ПредставлениеХарактеристики", СтрокаТабличнойЧасти.Характеристика);
		//ПараметрыНоменклатуры.Вставить("ПредставлениеАртикула", СтрокаТабличнойЧасти.Артикул);
		//ПараметрыНоменклатуры.Вставить("СтрокаСерийныеНомера", СтрокаСерийныеНомера);
		
		ПараметрыПакета = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатурыПоСерийныйНомер(СтрокаТабличнойЧасти.СерийныйНомер);
		
		//ДанныеПечати.Вставить("ПредставлениеНоменклатуры", ПечатьДокументовУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры));
		ПредставлениеНоменклатуры = ПараметрыНоменклатуры.ПредставлениеНоменклатуры + "(" + ПараметрыПакета.Характеристика.Наименование + ")";
		ДанныеПечати.Вставить("ПредставлениеНоменклатуры", ПредставлениеНоменклатуры);

		//
		ДанныеПечати.Вставить("Количество", ПараметрыПакета.КоличествоСостав);
		ДанныеПечати.Вставить("Объем", ПараметрыПакета.Объем);
		ДанныеПечати.Вставить("ЕдиницаИзмерения", "куб.м.");
		//ДанныеПечати.Вставить("Склад", СтрокаТабличнойЧасти.Склад);
		//ДанныеПечати.Вставить("Ячейка", СтрокаТабличнойЧасти.Ячейка);
		ДанныеПечати.Вставить("Пакет", СтрокаТабличнойЧасти.Пакет);
		
	КонецПроцедуры
	
	
	Процедура ЗаполнитьДанныеПечати(ДанныеПечати,ДанныеОбъекта,Макет,ТабличныйДокумент)  экспорт
		ссылка=ДанныеОбъекта.Ссылка;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|ГДЕ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
		|	И алк_ПеремещениеЗапасовЗапасы.Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПакетыИсторияЗаказовСрезПоследних.ЗаказПокупателя КАК ЗаказПокупателя,
		|	алк_ПараметрыПакетовСрезПоследних.Регистратор.Смена,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав КАК КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.Объем КАК Объем,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец) = ТИП(Справочник.КатегорииНоменклатуры)
		|			ТОГДА алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец
		|		ИНАЧЕ алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец.КатегорияНоменклатуры
		|	КОНЕЦ КАК КатегорияНоменклатур,
		|	алк_ПараметрыПакетовСрезПоследних.НомерПакета,
		|	алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ИЗ
		|	РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|			&ДатаСреза,
		|			СерийныйНомер В
		|				(ВЫБРАТЬ
		|					Вт.СерийныйНомер
		|				ИЗ
		|					Вт КАК Вт)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПакетыИсторияЗаказов.СрезПоследних(&ДатаСреза, ) КАК алк_ПакетыИсторияЗаказовСрезПоследних
		|		ПО алк_ПараметрыПакетовСрезПоследних.СерийныйНомер = алк_ПакетыИсторияЗаказовСрезПоследних.СерийныйНомер
		|ИТОГИ
		|	КОЛИЧЕСТВО(КоличествоСостав),
		|	СУММА(Объем)
		|ПО
		|	ЗаказПокупателя";
		
		Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ТипНоменклатуры",Перечисления.ТипыНоменклатуры.Запас);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаПокупатель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ЗаказПокупателя");
		 НомерСтроки=0;
		Пока ВыборкаПокупатель.Следующий() Цикл
			
			МакетГруппировки=Макет.ПолучитьОбласть("СтрокаГруппировки");
			ЗаполнитьДанныеПострокеГруппировка(ВыборкаПокупатель,ДанныеПечати);
			МакетГруппировки.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(МакетГруппировки);
			ДетальныеЗаписи=ВыборкаПокупатель.Выбрать();
			
			Пока ДетальныеЗаписи.Следующий() цикл
				НомерСтроки=НомерСтроки+1;
				МакетСтроки=Макет.ПолучитьОбласть("Строка");
				ЗаполнитьДанныеПоСтрокеДетальные(ДетальныеЗаписи,НомерСтроки,ДанныеПечати);
				МакетСтроки.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(МакетСтроки);
			КонецЦикла;
			
		КонецЦикла;
	
	КонецПроцедуры      
	
	Процедура	ЗаполнитьДанныеПострокеГруппировка(Строка,ДанныеПечати)
		ДанныеПечати.Очистить();
		ДанныеПечати.Вставить("Количество", Строка.КоличествоСостав);
		ДанныеПечати.Вставить("Объем", Строка.Объем);
		ДанныеПечати.Вставить("ЗаказПокупателя",Строка.ЗаказПокупателя);
	КонецПроцедуры
	
	Процедура ЗаполнитьДанныеПоСтрокеДетальные(Строка,НомерСтроки,ДанныеПечати)
		ДанныеПечати.Очистить();	
		ДанныеПечати.Вставить("НомерСтроки",НомерСтроки);
		ДанныеПечати.Вставить("ПредставлениеНоменклатуры", Строка.Характеристика);
		ДанныеПечати.Вставить("Количество", Строка.КоличествоСостав);
		ДанныеПечати.Вставить("Объем", Строка.Объем);
		ДанныеПечати.Вставить("ЕдиницаИзмерения", "куб.м.");
		ДанныеПечати.Вставить("Пакет", Строка.СерийныйНомер);	
	КонецПроцедуры
	
	
#КонецЕсли
